
var Ba = "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖー";

var ds = [

    ["ん","わ","ら","や","ま","は","な","た","さ","か","あ"],
    ["-","-","り","-","み","ひ","に","ち","し","き","い"],
    ["ー","-","る","ゆ","む","ふ","ぬ","つ","す","く","う"],
    ["-","-","れ","-","め","へ","ね","て","せ","け","え"],
    ["-","を","ろ","よ","も","ほ","の","と","そ","こ","お"],
    [],
    [],
    ["-","-","-","-","ぱ","ば","-","だ","ざ","が","-"],
    ["-","-","-","-","ぴ","び","-","ぢ","じ","ぎ","-"],
    ["-","-","-","-","ぷ","ぶ","-","づ","ず","ぐ","ゔ"],
    ["-","-","-","-","ぺ","べ","-","で","ぜ","げ","-"],
    ["â†µ","-","-","-","ぽ","ぼ","-","ど","ぞ","ご","â†"],        

  ];